import tamil
from random import randint

உள்ளீட்டுக்கோப்பு = open('சொற்கள்.txt','r')
சொற்கள் = உள்ளீட்டுக்கோப்பு.readlines()
சொல்லளவு = len(சொற்கள்)

def சீரற்றச்சொல்():
	சீரற்றவை = randint(0,சொல்லளவு)
	சொல் = சொற்கள்[சீரற்றவை].strip()
	return சொல்	


def gamePlay(சீரற்ற_சொல்):
	வாய்ப்புகள் = 3
	is_found = False
	ஊகவெழுத்துக்கள் = []
	ஊகம் = ''
	print('	'+'_ '*len(சீரற்ற_சொல்)+'\n')
	while வாய்ப்புகள்>0:
		ஊகம் = input('எழுத்து அல்லது சொல்லை ஊகிக்கவும்: ')
		if ஊகம்==சீரற்ற_சொல்:
			is_found = True
		else:
			if ஊகம் in ஊகவெழுத்துக்கள் :
				print(f"நீங்கள் ஏற்கனவே எழுத்தை ஊகித்துவிட்டீர்கள் {ஊகம்}.. வேறு ஏதாவது முயற்சிக்கவும்\n")
				continue
			print('	',end='')
			is_current_ஊகம் = False
			for எழுத்து in சீரற்ற_சொல்:
				if எழுத்து == ஊகம் :
					is_current_ஊகம் = True
					ஊகவெழுத்துக்கள்.append(எழுத்து)
					print(எழுத்து,end=' ')
					if len(சீரற்ற_சொல்) == len(ஊகவெழுத்துக்கள்):
						is_found = True
				elif எழுத்து in ஊகவெழுத்துக்கள்:
					print(எழுத்து,end=' ')
				else:
					print('_',end=' ')	
			print()		
		if is_found:
			print(f"வாழ்த்துக்கள். உங்கள் ஊகம் சரியாக இருந்தது. நீங்கள் ஊகித்த சொல் '{சீரற்ற_சொல்}' என்பதாகும். \n")		
			break
		if not is_current_ஊகம்:
			print(f'{ஊகம்} சொல் இல்லை')
			வாய்ப்புகள்-=1
			print(f'உங்களுக்கு இன்னும் {வாய்ப்புகள்} வாய்ப்புகளே உள்ளன\n')

	if not is_found:
		print(f"\n பொறுத்துக்கொள்ளுங்கள். தங்களின் ஊகங்கள் தவறாக இருந்தன. நீங்கள் ஊகித்திருக்கவேண்டிய சொல் '{சீரற்ற_சொல்}' என்பதாகும்.\n")		


def main():
	print(" சொல்லூக விளையாட்டு ".center(60,'-'))
	while True:
		சீரற்ற_சொல் = சீரற்றச்சொல்()
		gamePlay(சீரற்ற_சொல்)
		வாய்ப்புகள் = input("நீங்கள் மீண்டும் விளையாட விரும்புகிறீர்களா (ஆம்/இல்லை) :")
		if வாய்ப்புகள் in ['இல்லை', 'no','No','NO','n','N']:
			break


if __name__ == '__main__':
	main()
